Revit 2026 API

# WallPaint Properties

---

The WallPaint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CommonTintColor | The property labeled "Tint Color" from the "WallPaint" schema. |
|  | CommonTintToggle | The property labeled "Tint" from the "WallPaint" schema. |
|  | WallpaintApplication | The property labeled "Application" from the "WallPaint" schema. |
|  | WallpaintColor | The property labeled "Color" from the "WallPaint" schema. |
|  | WallpaintFinish | The property labeled "Finish" from the "WallPaint" schema. |

#### Reference

WallPaint Class

Autodesk.Revit.DB.Visual Namespace